app/views/tasks/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :category_id %><br>
    <%= f.collection_select :category_id, Category.all, :id, :name  %>

SELECT "levels".* FROM "levels"
---
    <%= f.label :level_id %><br>
    <%= f.collection_select :level_id, Level.all, :id, :name  %>