app/views/tasks/index.html.erb

<% if !session[:user_id].nil? %>
  <%= link_to new_user_task_path(User.find(session[:user_id])), class: "btn btn-success" do %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 17]]