app/views/users/_tasks.html.erb

<% @user.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 10]]