app/controllers/categories_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = 1
---
  def show
    @tasks = Task.where(:category => @category)