app/controllers/levels_controller.rb

SELECT "levels".* FROM "levels"  ORDER BY value
---
  def index
    @levels = Level.all.order('value')

SELECT "tasks".* FROM "tasks" WHERE "tasks"."level_id" = 8  ORDER BY category
---
  def show
    @tasks = Task.where(:level => @level)

INSERT INTO "levels" ("name", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hard"], ["value", 5], ["created_at", "2015-09-12 11:18:49.798308"], ["updated_at", "2015-09-12 11:18:49.798308"]]
---
  def create
    @level = Level.new(level_params)

    respond_to do |format|
      if @level.save

UPDATE "levels" SET "name" = ?, "updated_at" = ? WHERE "levels"."id" = ?  [["name", "Вообще п***ец"], ["updated_at", "2015-09-08 20:33:29.337567"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @level.update(level_params)

DELETE FROM "levels" WHERE "levels"."id" = ?  [["id", 5]]
---
  def destroy
    @level.destroy

SELECT  "levels".* FROM "levels" WHERE "levels"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_level
      @level = Level.find(params[:id])