app/controllers/sessions_controller.rb

	def create
    auth = request.env["omniauth.auth"]
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("provider", "uid", "name", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["provider", "identity"], ["uid", "7"], ["name", "Swat Getmann"], ["rating", 0.0], ["created_at", "2015-09-12 13:11:18.896065"], ["updated_at", "2015-09-12 13:11:18.896065"]]
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? LIMIT 1  [["provider", "github"], ["uid", "11033354"]]