app/controllers/tasks_controller.rb

  def index
    if params[:user_id]
      @tasks = Task.where(user_id: params[:user_id])
    else
      @tasks = Task.all
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" IS NULL
SELECT  "tasks".* FROM "tasks"  ORDER BY "tasks"."id" DESC LIMIT 1

  def new
    @user = User.where(id: params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL

  def create
    @task = Task.new(task_params)
    @task.rating = 0
    @task.user = User.find(session[:user_id])
    # @answer.new(params[:task][:answers])  # hell
    # @task.user ||= User.find(params[:user_id])      WTF?!

    respond_to do |format|
      if @task.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "tasks" ("name", "description", "category", "level", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "bop"], ["description", "bebop"], ["category", "Java"], ["level", 6], ["created_at", "2015-09-08 09:10:04.144158"], ["updated_at", "2015-09-08 09:10:04.144158"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "category" = ?, "level" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["category", "Ruby"], ["level", 10], ["updated_at", "2015-09-08 09:11:40.399630"], ["id", 1]]