app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "swat@gmail.com"], ["password_digest", "$2a$10$XVxhnVCyQNOEGzz8LTo95eHaFhK7MVYCpgZDlO/yswbifRNi8Oz0W"], ["updated_at", "2015-09-10 14:19:09.822723"], ["id", 7]]