app/controllers/welcome_controller.rb

  def index
  	@tasks = Task.all
  	@users = User.all
---
SELECT "tasks".* FROM "tasks"
SELECT "users".* FROM "users"