app/controllers/welcome_controller.rb

  def index
  	if params[:tag]
    	@tasks = Task.tagged_with(params[:tag]).order(rating: :desc).limit(10)
 	 	else
   	 	@tasks = Task.order(rating: :desc).limit(10)
 	 	end

  	# @tasks = Task.order(rating: :desc).limit(10)
  	@users = User.order(rating: :desc).limit(10)
---
SELECT  "tasks".* FROM "tasks"  ORDER BY "tasks"."rating" DESC LIMIT 10
SELECT  "users".* FROM "users"  ORDER BY "users"."rating" ASC, "users"."desc" ASC LIMIT 10